l1 = [1, 2, 3]
l2 = l1
print(f"{l1 = }\n{l2 = }\n")

# есть ссылочная зависимость
l2[0] = 1000
print(f"{l1 = }\n{l2 = }\n")

l3 = []
for el in l2:
    l3 += [el]

# нет ссылочной зависимости
l3[1] = 2000
print(f"{l1 = }\n{l2 = }\n{l3 = }\n")

# нет ссылочной зависимости
l4 = l3.copy()
l4[2] = 3000
print(f"{l1 = }\n{l2 = }\n{l3 = }\n{l4 = }\n\n")



d1 = {'a': 1, 'b': 2, 'c': 3}
d2 = d1
print(f"{d1 = }\n{d2 = }\n")

# есть ссылочная зависимость
d1['a'] = 1000
print(f"{d1 = }\n{d2 = }\n")

d3 = {}
for key, value in d2.items():
    d3[key] = value

# нет ссылочной зависимости
d3['b'] = 2000
print(f"{d1 = }\n{d2 = }\n{d3 = }\n")

# нет ссылочной зависимости
d4 = d3.copy()
d4['c'] = 3000
print(f"{d1 = }\n{d2 = }\n{d3 = }\n{d4 = }\n")
